Q) What is Pandas and it's use?

* Pandas is a open-source Python library used for data analysis and data manipulation.

It's use:-

1) It provides a convenient way to handle structured data, like tables in Python.


2) Pandas use for data cleaning and data preprocessing, such as handling missing values and removing duplicates.


3) Pandas is widely used in data science, finance, and many other fields for data analysis tasks.

In [1]:
import pandas as pd

df = pd.DataFrame({'Name': ['John', 'Emma', 'David', 'Sophia'],
        'Age': [25, 28, 31, 24],
        'City': ['New York', 'London', 'Paris', 'Sydney']})

df

     Name  Age      City
0    John   25  New York
1    Emma   28    London
2   David   31     Paris
3  Sophia   24    Sydney

Q) You have a DataFrame in Pandas columns, how to make a new column between 2nd and 3rd column?

In [2]:
# By using df.insert() function
# Format df.insert(index, 'new column name', Variable of values)

Sex = ['M', 'F', 'M', 'F']

df.insert(2, 'Sex', Sex)

df

     Name  Age Sex      City
0    John   25   M  New York
1    Emma   28   F    London
2   David   31   M     Paris
3  Sophia   24   F    Sydney

Q) How to delete a column and add a new ones in it's index position?

In [3]:
df.drop('City',axis=1,inplace=True)

Location = ['delhi', 'mumbai', 'kolkata', 'chennai']

df.insert(3, 'Address', Location)

df

     Name  Age Sex  Address
0    John   25   M    delhi
1    Emma   28   F   mumbai
2   David   31   M  kolkata
3  Sophia   24   F  chennai